# Задача 8
# Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если разрешается сделать один разлом по прямой между дольками
# (то есть разломить шоколадку на два прямоугольника).
# *Пример:*
# 3 2 4 -> yes
# 3 2 1 -> no

n = int(input("Введите n размер шоколадки в дольках: "))
m = int(input("Введите m размер шоколадки в дольках: "))
k = int(input("Введите количество отломленых долек k : "))

if k < m * n and (k % m == 0 or k % n == 0):
    print(f'{n} {m} {k} -> Да')
else:
    print(f'{n} {m} {k} -> Нет')
